<script setup lang="ts">
import type Book from "@/interfaces/bookInterface";
import SingularBook from "@/components/SingularBook.vue";

const books: Book[] = [
  {
    id: 1,
    name: "والدي",
    synopsis:
      "المغلوطة حول استنكار  النشوة وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن بفضل هؤ.",
    cover: "",
  },
  {
    id: 2,
    name: "Book 1",
    synopsis:
      "المغلوطة حول استنكار  النشوة وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن بفضل هؤ.",
    cover: "",
  },
  {
    id: 3,
    name: "Book 2",
    synopsis:
      "المغلوطة حول استنكار  النشوة وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن بفضل هؤ.",
    cover: "",
  },
  {
    id: 4,
    name: "Book 3",
    synopsis:
      "المغلوطة حول استنكار  النشوة وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن بفضل هؤ.",
    cover: "",
  },
  {
    id: 5,
    name: "Book 4",
    synopsis:
      "المغلوطة حول استنكار  النشوة وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن بفضل هؤ.",
    cover: "",
  },
  {
    id: 6,
    name: "Book 5",
    synopsis:
      "المغلوطة حول استنكار  النشوة وتمجيد الألم نشأت بالفعل، وسأعرض لك التفاصيل لتكتشف حقيقة وأساس تلك السعادة البشرية، فلا أحد يرفض أو يكره أو يتجنب الشعور بالسعادة، ولكن بفضل هؤ.",
    cover: "",
  },
];
</script>
<template>
  <div class="mt-10 grid grid-cols-1 grid-rows-2 justify-center gap-4 md:grid-cols-3">
    <SingularBook v-for="book in books" :key="book.id" :book="book" />
  </div>
</template>
