<script setup lang="ts"></script>
<template>
  <div class="hero bg-base-300 p-10">
    <div class="hero-content flex-col lg:flex-row-reverse">
      <div>
        <h1 class="text-center text-5xl font-bold lg:text-end">الصفحة الرئيسية</h1>
        <p class="py-6 text-end">
          هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على
          الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة
          لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام "هنا يوجد
          محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح
          النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص،
          وإذا قمت بإدخال "lorem ipsum" في أي محرك بحث ستظهر العديد من المواقع الحديثة العهد في
          نتائج البحث. على مدى السنين ظهرت نسخ جديدة ومختلفة من نص لوريم إيبسوم، أحياناً عن طريق
          الصدفة، وأحياناً عن عمد كإدخال بعض العبارات الفكاهية إليها.
        </p>
        <div class="flex w-full justify-end">
          <button class="btn btn-primary flex">Get Started</button>
        </div>
      </div>
    </div>
  </div>
</template>
